In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
csv_path = "./purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(csv_path)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
#Display the total number of players
player_count_df = len(purchase_data_df["SN"].unique())
summary_df = pd.DataFrame({"SN":[player_count_df]})
summary_df

    SN
0  576

In [4]:
#Purchasing Analysis (Total)

#Run basic calculations to obtain number of unique items, average price, etc.
unique_items = len(purchase_data_df["Item Name"].value_counts())
average_price = purchase_data_df["Price"].mean()
total_purchase = len(purchase_data_df["Purchase ID"].value_counts())
revenue = purchase_data_df["Price"].sum()

#Create a summary data frame to hold the results
summary_df = pd.DataFrame({"Number of Unique Items": [unique_items], "Average Price":[average_price], 
                           "Number of Purchases":[total_purchase], "Total Revenue":[revenue]})

#Optional: give the displayed data cleaner formatting
summary_df["Average Price"] = summary_df["Average Price"].map("${:.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2f}".format)
summary_df.head()
#Display the summary data frame

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

In [ ]:
#Gender Demographics
 
#Percentage and Count of Male Players

#Percentage and Count of Female Players

#Percentage and Count of Other / Non-Disclosed

In [3]:
purchase_data_df["Gender"].value_counts()
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
gender_demographic_df = purchase_data_df.groupby(["SN"])
print(gender_demographic_df)
gender_demographic_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000028FE1AFC940>

              Purchase ID  Age  Gender  Item ID  Item Name  Price
SN
Adairialis76            1    1       1        1          1      1
Adastirin33             1    1       1        1          1      1
Aeda94                  1    1       1        1          1      1
Aela59                  1    1       1        1          1      1
Aelaria33               1    1       1        1          1      1
Aelastirin39            2    2       2        2          2      2
Aelidru27               1    1       1        1          1      1
Aelin32                 3    3       3        3          3      3
Aelly27                 2    2       2        2          2      2
Aellynun67              1    1       1        1          1      1

In [6]:
gender_demographic = purchase_data_df["Gender"].value_counts()
gender_demographic_df = pd.DataFrame(gender_demographic)
gender_demographic_df.head()

                       Gender
Male                      652
Female                    113
Other / Non-Disclosed      15

In [ ]:
#Purchasing Analysis (Gender)
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame

In [ ]:
#Age Demographics
#Establish bins for ages
#Categorize the existing players using the age bins. Hint: use pd.cut()
#Calculate the numbers and percentages by age group
#Create a summary data frame to hold the results
#Optional: round the percentage column to two decimal points
#Display Age Demographics Table

In [ ]:
#Purchasing Analysis (Age)
#Bin the purchase_data data frame by age
#Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
#Create a summary data frame to hold the results
#Optional: give the displayed data cleaner formatting
#Display the summary data frame

In [ ]:
#Top Spenders
#Run basic calculations to obtain the results in the table below
#Create a summary data frame to hold the results
#Sort the total purchase value column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [ ]:
#ost Popular Items
#Retrieve the Item ID, Item Name, and Item Price columns
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value
#Create a summary data frame to hold the results
#Sort the purchase count column in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the summary data frame

In [ ]:
#Most Profitable Items
#Sort the above table by total purchase value in descending order
#Optional: give the displayed data cleaner formatting
#Display a preview of the data frame